МПР/src/Enums/ds_РежимыОбъединенияСкидок/ds_РежимыОбъединенияСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ds_РежимыОбъединенияСкидок</name>
  <enumValues>
    <name>НеНачислятьНаСуммуДругихСкидок</name>
  </enumValues>
  <enumValues>
    <name>НеНачислятьНаТоварыСоСкидкой</name>
  </enumValues>
  <enumValues>
    <name>НачислятьНаВсе</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Enums/ВидыОперацийЧекККМ/ВидыОперацийЧекККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЧекККМ</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЧековККМ</name>
  <enumValues>
    <name>Отложенный</name>
  </enumValues>
  <enumValues>
    <name>Аннулированный</name>
  </enumValues>
  <enumValues>
    <name>Пробитый</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

МПР/src/Documents/НачислениеИСписаниеБонусныхБаллов/НачислениеИСписаниеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеИСписаниеБонусныхБаллов</name>
  <registerRecords>AccumulationRegister.БонусныеБаллы</registerRecords>
  <attributes>
    <name>МаркетинговаяАкция</name>
    <type>
      <types>DocumentRef.МаркетинговаяАкция</types>
    </type>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>DefinedType.БонуснаяПрограммаСервисЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоНачисления</name>
    <type>
      <types>DefinedType.ПравилаНачисленияБонусныхБалловСервисЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовОтсрочкиНачалаДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтсрочкиНачалаДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисление</name>
    <attributes>
      <name>ДисконтнаяКарта</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ДисконтнаяКарта</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Баллы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БаллыКСписанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МПР/src/Catalogs/ds_НастройкиGMB/ds_НастройкиGMB.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ds_НастройкиGMB</name>
  <predefined>
    <items>
      <name>Основная</name>
      <description>Основная</description>
    </items>
  </predefined>
  <attributes>
    <name>ApiKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>68</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимОбъединенияСкидок</name>
    <type>
      <types>EnumRef.ds_РежимыОбъединенияСкидок</types>
    </type>
  </attributes>
</mdclass:Catalog>

МПР/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>GMB</name>
      <description>GetMeBack</description>
    </items>
    <items>
      <name>UDS</name>
      <description>UDS</description>
    </items>
    <items>
      <name>ИнтернетМагазин</name>
      <description>Интернет-магазин</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>GMB</name>
      <description>GetMeBack</description>
    </items>
    <items>
      <name>UDS</name>
      <description>UDS</description>
    </items>
  </predefined>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.БонусныеПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДляНакоплений</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВладельцаКартыПоШаблону</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/CommonModules/ds_GMB/Module.bsl
Функция НастройкиПодключения() Экспорт  
	
	Результат = Неопределено;
	
 	Запрос = Новый Запрос;
 	Запрос.Текст = 
 	"ВЫБРАТЬ ПЕРВЫЕ 1
 	|	ds_НастройкиGMB.ApiKey КАК ApiKey,
 	|	ВЫБОР ds_НастройкиGMB.РежимОбъединенияСкидок
 	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ds_РежимыОбъединенияСкидок.НеНачислятьНаСуммуДругихСкидок)
 	|			ТОГДА ""НеНачислятьНаСуммуДругихСкидок""  
 	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ds_РежимыОбъединенияСкидок.НеНачислятьНаТоварыСоСкидкой)
 	|			ТОГДА ""НеНачислятьНаТоварыСоСкидкой""
 	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ds_РежимыОбъединенияСкидок.НачислятьНаВсе)
 	|			ТОГДА ""НачислятьНаВсе""
 	|	КОНЕЦ КАК РежимОбъединенияСкидок,
 	|	ds_НастройкиGMB.ВебАдрес КАК ВебАдрес,
 	|	ds_НастройкиGMB.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
 	|	ds_НастройкиGMB.АдресРесурса КАК АдресРесурса
 	|ИЗ
 	|	Справочник.ds_НастройкиGMB КАК ds_НастройкиGMB
 	|ГДЕ
 	|	ds_НастройкиGMB.ApiKey <> """"
 	|	И ds_НастройкиGMB.ВебАдрес <> """"";
 	
 	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Результат = Новый Структура("ЗащищенноеСоединение, ВебАдрес, АдресРесурса, ApiKey, РежимОбъединенияСкидок");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;	
 	
 	Возврат Результат;
 	
 КонецФункции

Функция НайтиПользователя(ВводимоеЧисло, НастройкиПодключения) Экспорт
	
	Результат = Неопределено;
	
	Если НастройкиПодключения.ЗащищенноеСоединение Тогда 
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		HTTPСоединение = Новый HTTPСоединение(НастройкиПодключения.ВебАдрес,,,,, 10, ssl); 
	Иначе 
		HTTPСоединение = Новый HTTPСоединение(НастройкиПодключения.ВебАдрес,,,,, 10); 
	КонецЕсли;	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Данные = Новый Структура;
	Данные.Вставить("api_key", НастройкиПодключения.ApiKey);
	
	Если СтрДлина(ВводимоеЧисло) = 9 Тогда 
		Данные.Вставить("code", ВводимоеЧисло);
	Иначе
		Данные.Вставить("phone", "7" + ВводимоеЧисло);
	КонецЕсли;	
	
	ЗаписатьJSON(ЗаписьJSON, Данные);

	Текст = ЗаписьJSON.Закрыть();
	
	ТекстЗапроса = Новый HTTPЗапрос;
	ТекстЗапроса.Заголовки.Вставить("Content-Type", "application/json"); 
	
	Если СтрДлина(ВводимоеЧисло) = 9 Тогда 
		ТекстЗапроса.АдресРесурса = НастройкиПодключения.АдресРесурса + "code";   
	Иначе
		ТекстЗапроса.АдресРесурса = НастройкиПодключения.АдресРесурса + "get-users";   
	КонецЕсли;	
		
	ТекстЗапроса.УстановитьТелоИзСтроки(Текст, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		ОтветЗапроса = HTTPСоединение.ОтправитьДляОбработки(ТекстЗапроса);
		Если ОтветЗапроса.КодСостояния = 200 Тогда 
			СтрокаСообщения = ОтветЗапроса.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			ЧтениеJson = Новый ЧтениеJSON;
			ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
			Ответ = ПрочитатьJSON(ЧтениеJson);
			
			Если СтрДлина(ВводимоеЧисло) = 9 И Ответ.status = "ok" Тогда 
				Результат = Ответ.client;	
			КонецЕсли;
			
			Если СтрДлина(ВводимоеЧисло) = 10 И Ответ.users.Количество() Тогда 
				Результат = Ответ.users[0];	
			КонецЕсли;	
		КонецЕсли;	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить ответ от сервера GetMeBack!"
			+ Символы.ПС + ОписаниеОшибки());		
	КонецПопытки;		
	
	Возврат Результат;
	
КонецФункции    

Функция ОтправитьОплату(ПараметрыОплаты, НастройкиПодключения, ДисконтнаяКарта) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("bonus_id", "");
	Результат.Вставить("paid_bonus_id", "");
	Результат.Вставить("client_migration", "");	
					
	Если НастройкиПодключения.ЗащищенноеСоединение Тогда 
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		HTTPСоединение = Новый HTTPСоединение(НастройкиПодключения.ВебАдрес,,,,, 10, ssl); 
	Иначе 
		HTTPСоединение = Новый HTTPСоединение(НастройкиПодключения.ВебАдрес,,,,, 10); 
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ИнформационныеКарты.ВладелецКарты КАК Справочник.ФизическиеЛица).ds_ВнешнийИдентификатор КАК КодКлиента
	|ИЗ
	|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	|ГДЕ
	|	ИнформационныеКарты.Ссылка = &ДисконтнаяКарта";
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		
		Данные = Новый Структура;
		Данные.Вставить("api_key", НастройкиПодключения.ApiKey);
		Данные.Вставить("id_branch", ПараметрыОплаты.Магазин.ds_ИдентификаторАДЗ); 
		Данные.Вставить("id_client", СтрЗаменить(Выборка.КодКлиента, Символ(160), ""));
		Данные.Вставить("order_price", Формат(ПараметрыОплаты.order_price, "ЧГ="));
		Данные.Вставить("paid_bonus", Формат(ПараметрыОплаты.paid_bonus, "ЧГ="));
		Данные.Вставить("invoice_num", ПараметрыОплаты.invoice_num);
		Данные.Вставить("manager_name", ПараметрыОплаты.manager_name);
		
		ЗаписатьJSON(ЗаписьJSON, Данные);

		Текст = ЗаписьJSON.Закрыть();
		
		ТекстЗапроса = Новый HTTPЗапрос;
		ТекстЗапроса.Заголовки.Вставить("Content-Type", "application/json");
		ТекстЗапроса.АдресРесурса = НастройкиПодключения.АдресРесурса + "bonus";
		ТекстЗапроса.УстановитьТелоИзСтроки(Текст, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		
		Попытка
			ОтветЗапроса = HTTPСоединение.ОтправитьДляОбработки(ТекстЗапроса);
			Если ОтветЗапроса.КодСостояния = 200 Тогда 
				СтрокаСообщения = ОтветЗапроса.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				ЧтениеJson = Новый ЧтениеJSON;
				ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
				Ответ = ПрочитатьJSON(ЧтениеJson);
				
				Если Ответ.status = "ok" Тогда 
					Результат.Вставить("bonus_id", Ответ.bonus_id);
					Результат.Вставить("paid_bonus_id", Ответ.paid_bonus_id);	
				КонецЕсли;	
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить ответ от сервера GetMeBack! Баллы будут начислены позже."
				+ Символы.ПС + ОписаниеОшибки());		
		КонецПопытки;				
	ИначеЕсли ПараметрыОплаты.Свойство("phone") Тогда 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		
		Данные = Новый Структура;
		Данные.Вставить("api_key", НастройкиПодключения.ApiKey); 
		Данные.Вставить("phone", ПараметрыОплаты.phone);
		Данные.Вставить("invoice", ПараметрыОплаты.order_price);
		Данные.Вставить("invoice_num", ПараметрыОплаты.invoice_num);
		Данные.Вставить("invoice_date", Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd ЧЧ:мм:сс'"));
		Данные.Вставить("bonus_value", КоличествоБалловПоСумме(ПараметрыОплаты.order_price));
		
		ЗаписатьJSON(ЗаписьJSON, Данные);

		Текст = ЗаписьJSON.Закрыть();
		
		ТекстЗапроса = Новый HTTPЗапрос;
		ТекстЗапроса.Заголовки.Вставить("Content-Type", "application/json");
		ТекстЗапроса.АдресРесурса = НастройкиПодключения.АдресРесурса + "client-migration";
		ТекстЗапроса.УстановитьТелоИзСтроки(Текст, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		
		Попытка
			ОтветЗапроса = HTTPСоединение.ОтправитьДляОбработки(ТекстЗапроса);
			Если ОтветЗапроса.КодСостояния = 200 Тогда 
				СтрокаСообщения = ОтветЗапроса.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				ЧтениеJson = Новый ЧтениеJSON;
				ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
				Ответ = ПрочитатьJSON(ЧтениеJson);
				
				Если Ответ.code = "bad_phone" Тогда 
					Результат.Вставить("client_migration", "bad_phone");	
				КонецЕсли;	
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить ответ от сервера GetMeBack! Баллы будут начислены позже."
				+ Символы.ПС + ОписаниеОшибки());		
		КонецПопытки;	
	КонецЕсли;	
		
	Возврат Результат;
	
КонецФункции    

Функция ВыполнитьВозвратБаллов(ДокументСсылка, СуммаВозврата, НачислениеБонусов) Экспорт
	
	Результат = "";
	
	НастройкиПодключения = НастройкиПодключения();
	Если НастройкиПодключения = Неопределено Тогда 
		Возврат Результат;
	КонецЕсли;	
	
	Если НачислениеБонусов Тогда
		НомерТранзакции = ДокументСсылка.ds_НомерТранзакцииНачисленияБонусов;
	Иначе
		НомерТранзакции = ДокументСсылка.ds_НомерТранзакцииОплатыБонусами;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НомерТранзакции) Тогда 
		Данные = Новый Структура;
		Данные.Вставить("api_key", НастройкиПодключения.ApiKey); 
		
		Если НачислениеБонусов Тогда 
			Данные.Вставить("bonus_id", НомерТранзакции); 
		Иначе 
			Данные.Вставить("bonus_id", НомерТранзакции); 
		КонецЕсли;	
		
		Если НастройкиПодключения.ЗащищенноеСоединение Тогда 
			ssl = Новый ЗащищенноеСоединениеOpenSSL();
			HTTPСоединение = Новый HTTPСоединение(НастройкиПодключения.ВебАдрес,,,,, 10, ssl); 
		Иначе 
			HTTPСоединение = Новый HTTPСоединение(НастройкиПодключения.ВебАдрес,,,,, 10); 
		КонецЕсли;	
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		
		ЗаписатьJSON(ЗаписьJSON, Данные);

		Текст = ЗаписьJSON.Закрыть();
		
		ТекстЗапроса = Новый HTTPЗапрос;
		ТекстЗапроса.Заголовки.Вставить("Content-Type", "application/json");
		ТекстЗапроса.АдресРесурса = НастройкиПодключения.АдресРесурса + "cancel-operation";
		ТекстЗапроса.УстановитьТелоИзСтроки(Текст, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		
		Попытка
			ОтветЗапроса = HTTPСоединение.ОтправитьДляОбработки(ТекстЗапроса);
			Если ОтветЗапроса.КодСостояния = 200 Тогда 
				СтрокаСообщения = ОтветЗапроса.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				ЧтениеJson = Новый ЧтениеJSON;
				ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
				Ответ = ПрочитатьJSON(ЧтениеJson);
				
				Если Ответ.status = "ok" Тогда
					Результат = НомерТранзакции;	
				КонецЕсли;	
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить ответ от сервера GetMeBack! Баллы будут скорректированы позже."
				+ Символы.ПС + ОписаниеОшибки());		
		КонецПопытки;	
				
		Если НачислениеБонусов Тогда 
			СписатьБаллыСДК(ДокументСсылка.ДисконтнаяКарта, СуммаВозврата - ДокументСсылка.СуммаДокумента); 
		КонецЕсли;	
	КонецЕсли;	
		
	Возврат Результат;	
		
КонецФункции

Функция КоличествоБалловПоСумме(Сумма)
	
	Результат = 0;
	
	НастройкиПодключения = ds_GMB.НастройкиПодключения();
	
	Если НастройкиПодключения.ЗащищенноеСоединение Тогда 
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		HTTPСоединение = Новый HTTPСоединение(НастройкиПодключения.ВебАдрес,,,,, 10, ssl); 
	Иначе 
		HTTPСоединение = Новый HTTPСоединение(НастройкиПодключения.ВебАдрес,,,,, 10); 
	КонецЕсли;	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Данные = Новый Структура;
	Данные.Вставить("api_key", НастройкиПодключения.ApiKey); 
	Данные.Вставить("to_pay", Сумма);
	
	ЗаписатьJSON(ЗаписьJSON, Данные);

	Текст = ЗаписьJSON.Закрыть();
	
	ТекстЗапроса = Новый HTTPЗапрос;
	ТекстЗапроса.Заголовки.Вставить("Content-Type", "application/json");
	ТекстЗапроса.АдресРесурса = НастройкиПодключения.АдресРесурса + "calculate-bonus";
	ТекстЗапроса.УстановитьТелоИзСтроки(Текст, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		ОтветЗапроса = HTTPСоединение.ОтправитьДляОбработки(ТекстЗапроса);
		Если ОтветЗапроса.КодСостояния = 200 Тогда 
			СтрокаСообщения = ОтветЗапроса.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			ЧтениеJson = Новый ЧтениеJSON;
			ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
			Ответ = ПрочитатьJSON(ЧтениеJson);
			
			Результат = Ответ.bonus_value;
		КонецЕсли;
	Исключение	
	КонецПопытки;		
	
	Возврат Результат;
	
КонецФункции

Функция ПроверкаБонусныхБалловДК(ДисконтнаяКарта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОстаткиБонусныхБаллов = БонусныеБаллыСервер.ОстаткиИДвиженияБонусныхБаллов(ДисконтнаяКарта,КонецДня(ТекущаяДата()));
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОстаткиБонусныхБаллов[0].Сумма;
	
КонецФункции

Процедура НачислитьБаллыНаДК(ДисконтнаяКарта, НачисляемыеБаллы) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачислимБонусы = Документы.НачислениеИСписаниеБонусныхБаллов.СоздатьДокумент();
	НачислимБонусы.Дата = ТекущаяДата();
	НачислимБонусы.БонуснаяПрограммаЛояльности = Справочники.БонусныеПрограммыЛояльности.GMB;
	ДобавимСтроку = НачислимБонусы.Начисление.Добавить();
	ДобавимСтроку.ДисконтнаяКарта = ДисконтнаяКарта;
	ДобавимСтроку.Баллы = НачисляемыеБаллы;
	НачислимБонусы.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры

Процедура СписатьБаллыСДК(ДисконтнаяКарта, СписываемыеБаллы) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СпишемБонусы = Документы.НачислениеИСписаниеБонусныхБаллов.СоздатьДокумент();
	СпишемБонусы.Дата = ТекущаяДата();
	СпишемБонусы.БонуснаяПрограммаЛояльности = Справочники.БонусныеПрограммыЛояльности.GMB;
	ДобавимСтроку = СпишемБонусы.Списание.Добавить();
	ДобавимСтроку.ДисконтнаяКарта = ДисконтнаяКарта;
	ДобавимСтроку.Баллы = СписываемыеБаллы;
	СпишемБонусы.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный); 
	
	УстановитьПривилегированныйРежим(Ложь);  
	
КонецПроцедуры

Процедура ЗаписатьНомераТранзакций(НомераТранзакций, ДокументСсылка) Экспорт 
	
	ДобавимIDВДок = ДокументСсылка.ПолучитьОбъект();
	ДобавимIDВДок.ds_НомерТранзакцииНачисленияБонусов = Формат(НомераТранзакций.bonus_id, "ЧГ=");
	ДобавимIDВДок.ds_НомерТранзакцииОплатыБонусами = Формат(НомераТранзакций.paid_bonus_id, "ЧГ=");
	ДобавимIDВДок.Записать();
	
КонецПроцедуры

Функция ЭтоКартаGMB(ДисконтнаяКарта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнформационныеКарты.Ссылка
	|ИЗ
	|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	|ГДЕ
	|	ИнформационныеКарты.Ссылка = &Ссылка
	|	И ИнформационныеКарты.ВидДисконтнойКарты = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.GMB)";
	Запрос.УстановитьПараметр("Ссылка", ДисконтнаяКарта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ds_ОтправкаНеотправленныхЧековВGMB() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	НастройкиПодключенияGMB = НастройкиПодключения();
	Если НастройкиПодключенияGMB = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
		
	#Область Продажа
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧекККМ.Ссылка КАК Ссылка,
	|	ЧекККМ.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ЧекККМ.СуммаДокумента КАК СуммаДокумента,
	|	СУММА(ЕСТЬNULL(ЧекККМОплата.СуммаБонусовВСкидках, 0)) КАК СуммаБонусов,
	|	ЧекККМ.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ЧекККМ.СтатусЧекаККМ КАК СтатусЧекаККМ,
	|	ПРЕДСТАВЛЕНИЕ(ЧекККМ.Ответственный) КАК Ответственный,
	|	ЧекККМ.Магазин КАК Магазин
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Оплата КАК ЧекККМОплата
	|		ПО ЧекККМ.Ссылка = ЧекККМОплата.Ссылка
	|ГДЕ
	|	ЧекККМ.ds_НомерТранзакцииНачисленияБонусов = """"
	|	И ЧекККМ.СтатусЧекаККМ В (&СтатусыЧекаККМ)
	|	И ЧекККМ.Проведен
	|	И ЧекККМ.ДисконтнаяКарта.ВидДисконтнойКарты = &ВидДисконтнойКарты
	|	И ЧекККМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа)
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМ.Ссылка,
	|	ЧекККМ.ДисконтнаяКарта,
	|	ЧекККМ.СуммаДокумента,
	|	ЧекККМ.НомерЧекаККМ,
	|	ЧекККМ.СтатусЧекаККМ,
	|	ЧекККМ.Магазин,
	|	ПРЕДСТАВЛЕНИЕ(ЧекККМ.Ответственный)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЧекККМ.Дата";
	Запрос.УстановитьПараметр("ВидДисконтнойКарты", Справочники.ВидыДисконтныхКарт.GMB);
	
	СтатусыЧекаККМ = Новый Массив;
	СтатусыЧекаККМ.Добавить(Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("СтатусыЧекаККМ", СтатусыЧекаККМ);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	Для Каждого Стр Из ТЗ Цикл 
		ПараметрыОплатыGMB = Новый Структура;
		ПараметрыОплатыGMB.Вставить("order_price", Стр.СуммаДокумента + Стр.СуммаБонусов);
		ПараметрыОплатыGMB.Вставить("paid_bonus", Стр.СуммаБонусов);
		ПараметрыОплатыGMB.Вставить("invoice_num", Стр.НомерЧекаККМ); 
		ПараметрыОплатыGMB.Вставить("manager_name", Стр.Ответственный);
		ПараметрыОплатыGMB.Вставить("Магазин", Стр.Магазин);
		
		РезультатОплатыGMB = ОтправитьОплату(ПараметрыОплатыGMB, НастройкиПодключенияGMB, Стр.ДисконтнаяКарта);
		
		Если РезультатОплатыGMB <> Неопределено И ЗначениеЗаполнено(РезультатОплатыGMB.bonus_id) Тогда
			Чек = Стр.Ссылка.ПолучитьОбъект();
			
			Если Стр.СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Архивный Тогда 
				Чек.ОбменДанными.Загрузка = Истина;
			КонецЕсли;	
			
			Чек.ds_НомерТранзакцииНачисленияБонусов = Формат(РезультатОплатыGMB.bonus_id, "ЧГ=");
			Чек.ds_НомерТранзакцииОплатыБонусами = Формат(РезультатОплатыGMB.paid_bonus_id, "ЧГ=");
			Чек.Записать();
		КонецЕсли;
	КонецЦикла;	
	
	#КонецОбласти
	
	#Область Возвраты
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧекККМ.Ссылка КАК Ссылка,
	|	ЧекККМ.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ЧекККМ.СуммаДокумента КАК СуммаДокумента,
	|	ЧекККМ.Магазин КАК Магазин,
	|	ЧекККМ.ds_НомерТранзакцииНачисленияБонусов,
	|	ЧекККМ.ds_НомерТранзакцииОплатыБонусами,
	|	ЧекККМ.ЧекККМПродажа,
	|	ЧекККМ.ЧекККМПродажа.ds_НомерТранзакцииОплатыБонусами КАК ds_НомерТранзакцииОплатыБонусамиПродажа
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	(ЧекККМ.ds_НомерТранзакцииНачисленияБонусов = """"
	|	ИЛИ ЧекККМ.ds_НомерТранзакцииОплатыБонусами = """"
	|	И ЧекККМ.ЧекККМПродажа.ds_НомерТранзакцииОплатыБонусами = """")
	|	И ЧекККМ.СтатусЧекаККМ В (&СтатусыЧекаККМ)
	|	И ЧекККМ.Проведен
	|	И ЧекККМ.ДисконтнаяКарта.ВидДисконтнойКарты = &ВидДисконтнойКарты
	|	И ЧекККМ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат)
	|СГРУППИРОВАТЬ ПО
	|	ЧекККМ.Ссылка,
	|	ЧекККМ.ДисконтнаяКарта,
	|	ЧекККМ.Магазин,
	|	ПРЕДСТАВЛЕНИЕ(ЧекККМ.Ответственный),
	|	ЧекККМ.ds_НомерТранзакцииНачисленияБонусов,
	|	ЧекККМ.ds_НомерТранзакцииОплатыБонусами,
	|	ЧекККМ.СуммаДокумента,
	|	ЧекККМ.ЧекККМПродажа,
	|	ЧекККМ.ЧекККМПродажа.ds_НомерТранзакцииОплатыБонусами
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЧекККМ.Дата";
	Запрос.УстановитьПараметр("ВидДисконтнойКарты", Справочники.ВидыДисконтныхКарт.GMB);
	
	СтатусыЧекаККМ = Новый Массив;
	СтатусыЧекаККМ.Добавить(Перечисления.СтатусыЧековККМ.Архивный);
	Запрос.УстановитьПараметр("СтатусыЧекаККМ", СтатусыЧекаККМ);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из ТЗ Цикл 
		Чек = Стр.Ссылка.ПолучитьОбъект();
		
		Если Стр.СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Архивный Тогда 
			Чек.ОбменДанными.Загрузка = Истина;
		КонецЕсли;	
		
		Если ПустаяСтрока(Стр.ds_НомерТранзакцииНачисленияБонусов) Тогда
			Чек.ds_НомерТранзакцииНачисленияБонусов = ds_GMB.ВыполнитьВозвратБаллов(Стр.ЧекККМПродажа, ЭтаФорма.СуммаДокументаБезСкидок, Истина);
		ИначеЕсли ПустаяСтрока(Стр.ds_НомерТранзакцииОплатыБонусами) И Не ПустаяСтрока(Стр.ds_НомерТранзакцииОплатыБонусамиПродажа) Тогда 	
			Чек.ds_НомерТранзакцииОплатыБонусами = ds_GMB.ВыполнитьВозвратБаллов(Стр.ЧекККМПродажа, ЭтаФорма.СуммаДокументаБезСкидок, Ложь);
		КонецЕсли;				
			
		Чек.Записать();
	КонецЦикла;	
	
	#КонецОбласти
		
КонецПроцедуры
